
## Plan Result (prod)




<pre><code>Plan: 4 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.api.azurerm_api_management_api.api
  * module.api.azurerm_api_management_product_api.link_to_product[0]
  * module.plum_product.azurerm_api_management_product.product
  * module.policy.azurerm_api_management_api_policy.api_policy
* Update
  * module.plum-redis-storage.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api.azurerm_api_management_api.api will be created
  + resource "azurerm_api_management_api" "api" {
      + api_management_name   = "core-api-mgmt-prod"
      + api_type              = "http"
      + display_name          = "plum-recipes"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "plum-recipes-api"
      + path                  = "plum-recipes-api"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "core-infra-prod"
      + revision              = "1"
      + service_url           = "http://plum-recipe-backend-prod.service.core-compute-prod.internal"
      + soap_pass_through     = (known after apply)
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi+json-link"
          + content_value  = "https://raw.githubusercontent.com/hmcts/reform-api-docs/master/docs/specs/cnp-plum-recipes-service.json"
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.api.azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "core-api-mgmt-prod"
      + api_name            = "plum-recipes-api"
      + id                  = (known after apply)
      + product_id          = "plum-recipes"
      + resource_group_name = "core-infra-prod"
    }

  # module.plum-redis-storage.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/plum-recipe-backend-session-storage-cache-prod/providers/Microsoft.Cache/redis/plum-recipe-backend-session-storage-prod"
        name                          = "plum-recipe-backend-session-storage-prod"
        tags                          = {
            "application"         = "core"
            "builtFrom"           = "https://github.com/HMCTS/cnp-plum-recipes-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "production"
            "managedBy"           = "CNP"
        }
        # (24 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved         = 125 -> 642
          ~ maxmemory_delta                         = 125 -> 642
          ~ maxmemory_reserved                      = 125 -> 642
            # (15 unchanged attributes hidden)
        }
    }

  # module.plum_product.azurerm_api_management_product.product will be created
  + resource "azurerm_api_management_product" "product" {
      + api_management_name   = "core-api-mgmt-prod"
      + approval_required     = true
      + display_name          = "plum-recipes"
      + id                    = (known after apply)
      + product_id            = "plum-recipes"
      + published             = true
      + resource_group_name   = "core-infra-prod"
      + subscription_required = true
      + subscriptions_limit   = 20
    }

  # module.policy.azurerm_api_management_api_policy.api_policy will be created
  + resource "azurerm_api_management_api_policy" "api_policy" {
      + api_management_name = "core-api-mgmt-prod"
      + api_name            = "plum-recipes-api"
      + id                  = (known after apply)
      + resource_group_name = "core-infra-prod"
      + xml_content         = <<-EOT
            <policies>
                <backend>
                    <base/>
                </backend>
                <inbound>
                    <base/>
                    <choose>
                        <when condition="@(context.Request.Certificate == null)" >
                            <return-response>
                                <set-status code="401" />
                                <set-body>Missing client certificate</set-body>
                            </return-response>
                        </when>
                        <when condition="@(context.Request.Certificate.NotAfter &lt; DateTime.Now || context.Request.Certificate.NotBefore &gt; DateTime.Now || !(new string[] {&quot;8A13CF9CC991EDE7A2A227E4153A54F6E3157774&quot;,&quot;8B0666A1041156C83BCE832906F9BC7C2542B65A&quot;}.Any(c => c == context.Request.Certificate.Thumbprint)))" >
                            <return-response>
                                <set-status code="401" />
                                <set-body>Invalid client certificate</set-body>
                            </return-response>
                        </when>
                    </choose>
                </inbound>
                <outbound>
                    <base/>
                </outbound>
                <on-error>
                    <base/>
                </on-error>
            </policies>
        EOT
    }

Plan: 4 to add, 1 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.api.azurerm_api_management_api.api has been deleted
  - resource "azurerm_api_management_api" "api" {
        id                    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/core-infra-prod/providers/Microsoft.ApiManagement/service/core-api-mgmt-prod/apis/plum-recipes-api;rev=1"
      - name                  = "plum-recipes-api" -> null
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.plum_product.azurerm_api_management_product.product has been deleted
  - resource "azurerm_api_management_product" "product" {
      - id                    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/core-infra-prod/providers/Microsoft.ApiManagement/service/core-api-mgmt-prod/products/plum-recipes" -> null
      - product_id            = "plum-recipes" -> null
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":1060,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->